tutorials/CFD/22FSI_okk/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       23266;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       23306;
    }
    down
    {
        type            empty;
        inGroups        1(empty);
        nFaces          11644;
        startFace       23346;
    }
    up
    {
        type            empty;
        inGroups        1(empty);
        nFaces          11644;
        startFace       34990;
    }
    sides
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       46634;
    }
    cylinder1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          318;
        startFace       46834;
    }
)

// ************************************************************************* //
