tutorials/CFD/22FSI_okk/constant/dynamicMeshDict3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh    staticFvMesh; //dynamicMotionSolverFvMesh;

staticFvMeshCoeffs
{
    centreOfMass    (0 0 0);
    mass            0.1;
    momentOfInertia (1 1 0.03);//mass
    transform       (1 0 0 0 1 0 0 0 1) (2.929541 0 0.2);
    origin          (0.0 0.0 0.0);
    CofR        (0 0 0);
}



// ************************************************************************* //
