tutorials/CFD/22FSI_okk/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesUout 2;
NmodesPout 2;
NmodesUproj 2;
NmodesPproj 2;
//NmodesSUPout 15;
//NmodesSUPproj 10;


// Output format to save market vectors.
OutPrecision 20;
OutType fixed;
//bcMethod penalty;
warning false;

// // Inlet boundary conditions velocities.
 online_velocities vel.txt;
 //POD_U Frobenius;
 //POD_p Frobenius;

// // Do not export middle fields for this case
// middleExport false;

startTime 0.5;
finalTime 1.1;
timeStep    5e-03;
writeEvery  1e-02;//5e-01;
